patchew-project/qemu/hw/misc/rp2040_sio.c
/*
 * RP2040 single-cycle IO block emulation
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */

#include "qemu/osdep.h"
#include "hw/misc/rp2040_nyi.h"
#include "hw/misc/rp2040_sio.h"
#include "hw/core/cpu.h"
#include "hw/core/qdev-properties.h"
#include "migration/vmstate.h"
#include "qemu/bitops.h"
#include "qemu/log.h"
#include "qemu/module.h"

#define SIO_CPUID               0x000
#define SIO_GPIO_IN             0x004
#define SIO_GPIO_HI_IN          0x008
#define SIO_GPIO_OUT            0x010
#define SIO_GPIO_OUT_SET        0x014
#define SIO_GPIO_OUT_CLR        0x018
#define SIO_GPIO_OUT_XOR        0x01c
#define SIO_GPIO_OE             0x020
#define SIO_GPIO_OE_SET         0x024
#define SIO_GPIO_OE_CLR         0x028
#define SIO_GPIO_OE_XOR         0x02c
#define SIO_GPIO_HI_OUT         0x030
#define SIO_GPIO_HI_OUT_SET     0x034
#define SIO_GPIO_HI_OUT_CLR     0x038
#define SIO_GPIO_HI_OUT_XOR     0x03c
#define SIO_GPIO_HI_OE          0x040
#define SIO_GPIO_HI_OE_SET      0x044
#define SIO_GPIO_HI_OE_CLR      0x048
#define SIO_GPIO_HI_OE_XOR      0x04c
#define SIO_FIFO_ST             0x050
#define SIO_FIFO_WR             0x054
#define SIO_FIFO_RD             0x058
#define SIO_SPINLOCK_ST         0x05c
#define SIO_DIV_UDIVIDEND       0x060
#define SIO_DIV_UDIVISOR        0x064
#define SIO_DIV_SDIVIDEND       0x068
#define SIO_DIV_SDIVISOR        0x06c
#define SIO_DIV_QUOTIENT        0x070
#define SIO_DIV_REMAINDER       0x074
#define SIO_DIV_CSR             0x078
#define SIO_INTERP0_BASE        0x080
#define SIO_INTERP1_BASE        0x0c0
#define SIO_INTERP_BLOCK_SIZE   0x040
#define SIO_INTERP_ACCUM0       0x00
#define SIO_INTERP_ACCUM1       0x04
#define SIO_INTERP_BASE0        0x08
#define SIO_INTERP_BASE1        0x0c
#define SIO_INTERP_BASE2        0x10
#define SIO_INTERP_POP_LANE0    0x14
#define SIO_INTERP_POP_LANE1    0x18
#define SIO_INTERP_POP_FULL     0x1c
#define SIO_INTERP_PEEK_LANE0   0x20
#define SIO_INTERP_PEEK_LANE1   0x24
#define SIO_INTERP_PEEK_FULL    0x28
#define SIO_INTERP_CTRL_LANE0   0x2c
#define SIO_INTERP_CTRL_LANE1   0x30
#define SIO_INTERP_ACCUM0_ADD   0x34
#define SIO_INTERP_ACCUM1_ADD   0x38
#define SIO_INTERP_BASE_1AND0   0x3c
#define SIO_SPINLOCK_BASE       0x100
#define SIO_SPINLOCK_LAST       0x17c

#define SIO_GPIO_MASK           0x3fffffff
#define SIO_GPIO_HI_MASK        0x3f
#define SIO_FIFO_ST_VLD         BIT(0)
#define SIO_FIFO_ST_RDY         BIT(1)
#define SIO_FIFO_ST_WC_MASK     (BIT(3) | BIT(2))
#define SIO_DIV_CSR_READY       BIT(0)
#define SIO_DIV_CSR_DIRTY       BIT(1)
#define SIO_INTERP_CTRL_FORCE_MSB_SHIFT 19
#define SIO_INTERP_CTRL_ADD_RAW         BIT(18)
#define SIO_INTERP_CTRL_CROSS_RESULT    BIT(17)
#define SIO_INTERP_CTRL_CROSS_INPUT     BIT(16)
#define SIO_INTERP_CTRL_SIGNED          BIT(15)
#define SIO_INTERP_CTRL_MASK_MSB_SHIFT  10
#define SIO_INTERP_CTRL_MASK_LSB_SHIFT  5
#define SIO_INTERP_CTRL_SHIFT_MASK      0x1f
#define SIO_INTERP_CTRL_LSB_MASK        (0x1f << 5)
#define SIO_INTERP_CTRL_MSB_MASK        (0x1f << 10)
#define SIO_INTERP0_CTRL_BLEND          BIT(21)
#define SIO_INTERP1_CTRL_CLAMP          BIT(22)
#define SIO_INTERP_CTRL_OVERF           BIT(25)
#define SIO_INTERP_CTRL_OVERF1          BIT(24)
#define SIO_INTERP_CTRL_OVERF0          BIT(23)
#define SIO_INTERP_CTRL_OVERF_MASK      (SIO_INTERP_CTRL_OVERF | \
                                         SIO_INTERP_CTRL_OVERF1 | \
                                         SIO_INTERP_CTRL_OVERF0)

typedef struct RP2040SioInterpResult {
    uint32_t raw[RP2040_SIO_INTERP_NUM_LANES];
    uint32_t lane[RP2040_SIO_INTERP_NUM_LANES];
    uint32_t full;
} RP2040SioInterpResult;

static unsigned rp2040_sio_current_core(void)
{
    /*
     * current_cpu is QEMU's thread-local pointer to the currently executing
     * guest vCPU, not a host CPU identifier.
     */
    if (current_cpu && current_cpu->cpu_index == 1) {
        return 1;
    }

    return 0;
}

static void rp2040_sio_update_fifo_irq(RP2040SioState *s)
{
    int i;

    for (i = 0; i < RP2040_SIO_NUM_CORES; i++) {
        qemu_set_irq(s->fifo_irq[i], s->fifo_level[i] != 0);
    }
}

static uint32_t rp2040_sio_fifo_status(RP2040SioState *s, unsigned core)
{
    unsigned peer = core ^ 1;
    uint32_t value = s->fifo_sticky[core] & SIO_FIFO_ST_WC_MASK;

    if (s->fifo_level[core] != 0) {
        value |= SIO_FIFO_ST_VLD;
    }
    if (s->fifo_level[peer] < RP2040_SIO_FIFO_DEPTH) {
        value |= SIO_FIFO_ST_RDY;
    }

    return value;
}

static void rp2040_sio_fifo_push(RP2040SioState *s, unsigned core,
                                 uint32_t value)
{
    unsigned peer = core ^ 1;

    if (s->fifo_level[peer] == RP2040_SIO_FIFO_DEPTH) {
        s->fifo_sticky[core] |= BIT(2);
        return;
    }

    s->fifo[peer][s->fifo_wptr[peer]] = value;
    s->fifo_wptr[peer] = (s->fifo_wptr[peer] + 1) % RP2040_SIO_FIFO_DEPTH;
    s->fifo_level[peer]++;
    rp2040_sio_update_fifo_irq(s);
}

static uint32_t rp2040_sio_fifo_pop(RP2040SioState *s, unsigned core)
{
    uint32_t value;

    if (s->fifo_level[core] == 0) {
        s->fifo_sticky[core] |= BIT(3);
        return 0;
    }

    value = s->fifo[core][s->fifo_rptr[core]];
    s->fifo_rptr[core] = (s->fifo_rptr[core] + 1) % RP2040_SIO_FIFO_DEPTH;
    s->fifo_level[core]--;
    rp2040_sio_update_fifo_irq(s);

    return value;
}

static bool rp2040_sio_spinlock_offset(hwaddr offset, unsigned *index)
{
    if (offset < SIO_SPINLOCK_BASE || offset > SIO_SPINLOCK_LAST ||
        (offset & 0x3)) {
        return false;
    }

    *index = (offset - SIO_SPINLOCK_BASE) / sizeof(uint32_t);
    return *index < 32;
}

static int32_t rp2040_sio_sign32(uint32_t value)
{
    int32_t signed_value = (int32_t)value;

    if (signed_value > 0) {
        return 1;
    }
    if (signed_value < 0) {
        return -1;
    }
    return 0;
}

static void rp2040_sio_divide(RP2040SioState *s, unsigned core,
                              bool is_signed)
{
    uint32_t dividend = s->div_dividend[core];
    uint32_t divisor = s->div_divisor[core];
    uint32_t quotient;
    uint32_t remainder;

    if (is_signed) {
        int32_t signed_dividend = (int32_t)dividend;
        int32_t signed_divisor = (int32_t)divisor;

        if (signed_divisor == 0) {
            quotient = -rp2040_sio_sign32(dividend);
            remainder = dividend;
        } else if (signed_dividend == INT32_MIN && signed_divisor == -1) {
            quotient = dividend;
            remainder = 0;
        } else {
            quotient = signed_dividend / signed_divisor;
            remainder = signed_dividend % signed_divisor;
        }
    } else if (divisor == 0) {
        quotient = UINT32_MAX;
        remainder = dividend;
    } else {
        quotient = dividend / divisor;
        remainder = dividend % divisor;
    }

    s->div_quotient[core] = quotient;
    s->div_remainder[core] = remainder;
    s->div_dirty[core] = true;
}

static uint32_t rp2040_sio_div_csr(RP2040SioState *s, unsigned core)
{
    return SIO_DIV_CSR_READY |
           (s->div_dirty[core] ? SIO_DIV_CSR_DIRTY : 0);
}

static unsigned rp2040_sio_interp_index(unsigned interp, unsigned lane)
{
    return interp * RP2040_SIO_INTERP_NUM_LANES + lane;
}

static unsigned rp2040_sio_interp_base_index(unsigned interp, unsigned base)
{
    return interp * RP2040_SIO_INTERP_NUM_BASES + base;
}

static uint32_t rp2040_sio_interp_ctrl_mask(unsigned interp, unsigned lane)
{
    uint32_t mask = SIO_INTERP_CTRL_SHIFT_MASK |
                    SIO_INTERP_CTRL_LSB_MASK |
                    SIO_INTERP_CTRL_MSB_MASK |
                    SIO_INTERP_CTRL_SIGNED |
                    SIO_INTERP_CTRL_CROSS_INPUT |
                    SIO_INTERP_CTRL_CROSS_RESULT |
                    SIO_INTERP_CTRL_ADD_RAW |
                    (0x3 << SIO_INTERP_CTRL_FORCE_MSB_SHIFT);

    if (interp == 0 && lane == 0) {
        mask |= SIO_INTERP0_CTRL_BLEND;
    } else if (interp == 1 && lane == 0) {
        mask |= SIO_INTERP1_CTRL_CLAMP;
    }

    return mask;
}

static bool rp2040_sio_interp_offset(hwaddr addr, unsigned *interp,
                                     hwaddr *reg)
{
    if (addr >= SIO_INTERP0_BASE &&
        addr < SIO_INTERP0_BASE + SIO_INTERP_BLOCK_SIZE) {
        *interp = 0;
        *reg = addr - SIO_INTERP0_BASE;
        return true;
    }

