patchew-project/qemu/hw/misc/rp2040_sio.c
    if (addr >= SIO_INTERP1_BASE &&
        addr < SIO_INTERP1_BASE + SIO_INTERP_BLOCK_SIZE) {
        *interp = 1;
        *reg = addr - SIO_INTERP1_BASE;
        return true;
    }

    return false;
}

static uint32_t rp2040_sio_interp_mask(unsigned lsb, unsigned msb)
{
    if (msb < lsb) {
        return 0;
    }

    if (msb == 31) {
        return UINT32_MAX << lsb;
    }

    return (BIT(msb + 1) - 1) & ~(BIT(lsb) - 1);
}

static uint32_t rp2040_sio_interp_sign_extend(uint32_t value, unsigned msb)
{
    if (msb == 31 || !(value & BIT(msb))) {
        return value;
    }

    return value | (UINT32_MAX << (msb + 1));
}

static uint32_t rp2040_sio_interp_raw(RP2040SioState *s, unsigned core,
                                      unsigned interp, unsigned lane)
{
    uint32_t ctrl = s->interp_ctrl[core]
                                  [rp2040_sio_interp_index(interp, lane)];
    uint32_t input;
    uint32_t shifted;
    uint32_t value;
    unsigned shift = ctrl & SIO_INTERP_CTRL_SHIFT_MASK;
    unsigned lsb = (ctrl & SIO_INTERP_CTRL_LSB_MASK) >>
                   SIO_INTERP_CTRL_MASK_LSB_SHIFT;
    unsigned msb = (ctrl & SIO_INTERP_CTRL_MSB_MASK) >>
                   SIO_INTERP_CTRL_MASK_MSB_SHIFT;

    input = s->interp_accum[core][rp2040_sio_interp_index(
                                  interp,
                                  (ctrl & SIO_INTERP_CTRL_CROSS_INPUT) ?
                                  (lane ^ 1) : lane)];
    if (ctrl & SIO_INTERP_CTRL_ADD_RAW) {
        return input;
    }

    shifted = input >> shift;
    value = shifted & rp2040_sio_interp_mask(lsb, msb);
    if (ctrl & SIO_INTERP_CTRL_SIGNED) {
        value = rp2040_sio_interp_sign_extend(value, msb);
    }

    return value;
}

static uint32_t rp2040_sio_interp_force_msb(RP2040SioState *s, unsigned core,
                                            unsigned interp, unsigned lane,
                                            uint32_t value)
{
    uint32_t ctrl = s->interp_ctrl[core]
                                  [rp2040_sio_interp_index(interp, lane)];
    uint32_t force = (ctrl >> SIO_INTERP_CTRL_FORCE_MSB_SHIFT) & 0x3;

    return value | (force << 28);
}

static uint32_t rp2040_sio_interp_blend_result(RP2040SioState *s,
                                               unsigned core, uint32_t alpha)
{
    uint32_t ctrl1 = s->interp_ctrl[core][rp2040_sio_interp_index(0, 1)];
    uint32_t base0 = s->interp_base[core][rp2040_sio_interp_base_index(0, 0)];
    uint32_t base1 = s->interp_base[core][rp2040_sio_interp_base_index(0, 1)];
    int64_t start;
    int64_t end;

    if (ctrl1 & SIO_INTERP_CTRL_SIGNED) {
        start = (int16_t)base0;
        end = (int16_t)base1;
    } else {
        start = (uint16_t)base0;
        end = (uint16_t)base1;
    }

    return start + (((end - start) * (alpha & 0xff)) >> 8);
}

static void rp2040_sio_interp_compute(RP2040SioState *s, unsigned core,
                                      unsigned interp,
                                      RP2040SioInterpResult *result)
{
    bool blend = interp == 0 &&
                 (s->interp_ctrl[core][rp2040_sio_interp_index(0, 0)] &
                  SIO_INTERP0_CTRL_BLEND);
    bool clamp = interp == 1 &&
                 (s->interp_ctrl[core][rp2040_sio_interp_index(1, 0)] &
                  SIO_INTERP1_CTRL_CLAMP);
    uint32_t base0 = s->interp_base[core]
                                   [rp2040_sio_interp_base_index(interp, 0)];
    uint32_t base1 = s->interp_base[core]
                                   [rp2040_sio_interp_base_index(interp, 1)];
    uint32_t base2 = s->interp_base[core]
                                   [rp2040_sio_interp_base_index(interp, 2)];

    result->raw[0] = rp2040_sio_interp_raw(s, core, interp, 0);
    result->raw[1] = rp2040_sio_interp_raw(s, core, interp, 1);
    result->lane[0] = base0 + result->raw[0];
    result->lane[1] = base1 + result->raw[1];
    result->full = base2 + result->raw[0] + result->raw[1];

    if (blend) {
        uint32_t alpha = result->raw[1] & 0xff;

        result->lane[0] = alpha;
        result->lane[1] = rp2040_sio_interp_blend_result(s, core, alpha);
        result->full = base2 + result->raw[0];
    } else if (clamp) {
        uint32_t ctrl0 = s->interp_ctrl[core][rp2040_sio_interp_index(1, 0)];

        if (ctrl0 & SIO_INTERP_CTRL_SIGNED) {
            int32_t value = result->raw[0];
            int32_t lower = base0;
            int32_t upper = base1;

            result->lane[0] = value < lower ? lower :
                              value > upper ? upper : value;
        } else {
            result->lane[0] = result->raw[0] < base0 ? base0 :
                              result->raw[0] > base1 ? base1 :
                              result->raw[0];
        }
    }
}

static uint32_t rp2040_sio_interp_pop(RP2040SioState *s, unsigned core,
                                      unsigned interp, unsigned lane)
{
    RP2040SioInterpResult result;
    uint32_t ctrl0 = s->interp_ctrl[core]
                                   [rp2040_sio_interp_index(interp, 0)];
    uint32_t ctrl1 = s->interp_ctrl[core]
                                   [rp2040_sio_interp_index(interp, 1)];
    uint32_t next0;
    uint32_t next1;

    rp2040_sio_interp_compute(s, core, interp, &result);
    next0 = (ctrl0 & SIO_INTERP_CTRL_CROSS_RESULT) ?
            result.lane[1] : result.lane[0];
    next1 = (ctrl1 & SIO_INTERP_CTRL_CROSS_RESULT) ?
            result.lane[0] : result.lane[1];

    s->interp_accum[core][rp2040_sio_interp_index(interp, 0)] = next0;
    s->interp_accum[core][rp2040_sio_interp_index(interp, 1)] = next1;

    return lane < 2 ? rp2040_sio_interp_force_msb(s, core, interp, lane,
                                                  result.lane[lane]) :
                      result.full;
}

static uint32_t rp2040_sio_interp_overf(RP2040SioState *s, unsigned core,
                                        unsigned interp, unsigned lane)
{
    uint32_t ctrl = s->interp_ctrl[core]
                                  [rp2040_sio_interp_index(interp, lane)];
    unsigned shift = ctrl & SIO_INTERP_CTRL_SHIFT_MASK;
    unsigned lsb = (ctrl & SIO_INTERP_CTRL_LSB_MASK) >>
                   SIO_INTERP_CTRL_MASK_LSB_SHIFT;
    unsigned msb = (ctrl & SIO_INTERP_CTRL_MSB_MASK) >>
                   SIO_INTERP_CTRL_MASK_MSB_SHIFT;
    uint32_t input = s->interp_accum[core][rp2040_sio_interp_index(
                                           interp,
                                           (ctrl &
                                            SIO_INTERP_CTRL_CROSS_INPUT) ?
                                           (lane ^ 1) : lane)];
    uint32_t shifted = input >> shift;

    return (shifted & ~rp2040_sio_interp_mask(lsb, msb)) != 0;
}

static uint32_t rp2040_sio_interp_ctrl_read(RP2040SioState *s, unsigned core,
                                            unsigned interp, unsigned lane)
{
    uint32_t ctrl = s->interp_ctrl[core]
                                  [rp2040_sio_interp_index(interp, lane)];
    bool overf0 = rp2040_sio_interp_overf(s, core, interp, 0);
    bool overf1 = rp2040_sio_interp_overf(s, core, interp, 1);

