patchew-project/qemu/hw/misc/rp2040_sio.c
    ctrl &= ~SIO_INTERP_CTRL_OVERF_MASK;
    if (overf0) {
        ctrl |= SIO_INTERP_CTRL_OVERF0;
    }
    if (overf1) {
        ctrl |= SIO_INTERP_CTRL_OVERF1;
    }
    if (overf0 || overf1) {
        ctrl |= SIO_INTERP_CTRL_OVERF;
    }

    return ctrl;
}

static uint32_t rp2040_sio_interp_read(RP2040SioState *s, unsigned core,
                                       unsigned interp, hwaddr reg)
{
    RP2040SioInterpResult result;

    switch (reg) {
    case SIO_INTERP_ACCUM0:
    case SIO_INTERP_ACCUM1:
        return s->interp_accum[core][rp2040_sio_interp_index(
                                     interp, reg == SIO_INTERP_ACCUM1)];
    case SIO_INTERP_BASE0:
    case SIO_INTERP_BASE1:
    case SIO_INTERP_BASE2:
        return s->interp_base[core][rp2040_sio_interp_base_index(
                                  interp, (reg - SIO_INTERP_BASE0) /
                                          sizeof(uint32_t))];
    case SIO_INTERP_POP_LANE0:
        return rp2040_sio_interp_pop(s, core, interp, 0);
    case SIO_INTERP_POP_LANE1:
        return rp2040_sio_interp_pop(s, core, interp, 1);
    case SIO_INTERP_POP_FULL:
        return rp2040_sio_interp_pop(s, core, interp, 2);
    case SIO_INTERP_PEEK_LANE0:
    case SIO_INTERP_PEEK_LANE1:
    case SIO_INTERP_PEEK_FULL:
        rp2040_sio_interp_compute(s, core, interp, &result);
        if (reg == SIO_INTERP_PEEK_LANE0) {
            return rp2040_sio_interp_force_msb(s, core, interp, 0,
                                               result.lane[0]);
        }
        if (reg == SIO_INTERP_PEEK_LANE1) {
            return rp2040_sio_interp_force_msb(s, core, interp, 1,
                                               result.lane[1]);
        }
        return result.full;
    case SIO_INTERP_CTRL_LANE0:
    case SIO_INTERP_CTRL_LANE1:
        return rp2040_sio_interp_ctrl_read(s, core, interp,
                                           reg == SIO_INTERP_CTRL_LANE1);
    case SIO_INTERP_ACCUM0_ADD:
    case SIO_INTERP_ACCUM1_ADD:
        return rp2040_sio_interp_raw(s, core, interp,
                                     reg == SIO_INTERP_ACCUM1_ADD);
    case SIO_INTERP_BASE_1AND0:
        return 0;
    default:
        return 0;
    }
}

static void rp2040_sio_interp_write(RP2040SioState *s, unsigned core,
                                    unsigned interp, hwaddr reg,
                                    uint32_t value)
{
    unsigned lane;
    unsigned base;
    bool base01_signed;

    switch (reg) {
    case SIO_INTERP_ACCUM0:
    case SIO_INTERP_ACCUM1:
        lane = reg == SIO_INTERP_ACCUM1;
        s->interp_accum[core][rp2040_sio_interp_index(interp, lane)] = value;
        break;
    case SIO_INTERP_BASE0:
    case SIO_INTERP_BASE1:
    case SIO_INTERP_BASE2:
        base = (reg - SIO_INTERP_BASE0) / sizeof(uint32_t);
        s->interp_base[core][rp2040_sio_interp_base_index(interp, base)] =
            value;
        break;
    case SIO_INTERP_CTRL_LANE0:
    case SIO_INTERP_CTRL_LANE1:
        lane = reg == SIO_INTERP_CTRL_LANE1;
        s->interp_ctrl[core][rp2040_sio_interp_index(interp, lane)] =
            value & rp2040_sio_interp_ctrl_mask(interp, lane);
        break;
    case SIO_INTERP_ACCUM0_ADD:
    case SIO_INTERP_ACCUM1_ADD:
        lane = reg == SIO_INTERP_ACCUM1_ADD;
        s->interp_accum[core][rp2040_sio_interp_index(interp, lane)] +=
            value & 0x00ffffff;
        break;
    case SIO_INTERP_BASE_1AND0:
        base01_signed = interp == 0 &&
                        (s->interp_ctrl[core]
                                       [rp2040_sio_interp_index(0, 0)] &
                         SIO_INTERP0_CTRL_BLEND) ?
                        (s->interp_ctrl[core]
                                       [rp2040_sio_interp_index(0, 1)] &
                         SIO_INTERP_CTRL_SIGNED) : false;

        for (base = 0; base < 2; base++) {
            uint16_t half = value >> (base * 16);
            bool sign = base01_signed ||
                        (s->interp_ctrl[core]
                                       [rp2040_sio_interp_index(interp,
                                                                base)] &
                         SIO_INTERP_CTRL_SIGNED);

            s->interp_base[core][rp2040_sio_interp_base_index(interp, base)] =
                sign ? (uint32_t)(int16_t)half : half;
        }
        break;
    default:
        break;
    }
}

static uint64_t rp2040_sio_read(void *opaque, hwaddr addr, unsigned size)
{
    RP2040SioState *s = opaque;
    unsigned core = rp2040_sio_current_core();
    unsigned interp;
    unsigned index;
    unsigned shift = (addr & 3) * 8;
    hwaddr interp_reg;
    hwaddr reg = addr & ~3ULL;
    uint64_t value;

    if (rp2040_sio_interp_offset(reg, &interp, &interp_reg)) {
        value = rp2040_sio_interp_read(s, core, interp, interp_reg);
        return extract64(value, shift, size * 8);
    }

    switch (reg) {
    case SIO_CPUID:
        value = core;
        break;
    case SIO_GPIO_IN:
        value = s->gpio_in;
        break;
    case SIO_GPIO_HI_IN:
        value = s->gpio_hi_in;
        break;
    case SIO_GPIO_OUT:
        value = s->gpio_out;
        break;
    case SIO_GPIO_OE:
        value = s->gpio_oe;
        break;
    case SIO_GPIO_HI_OUT:
        value = s->gpio_hi_out;
        break;
    case SIO_GPIO_HI_OE:
        value = s->gpio_hi_oe;
        break;
    case SIO_FIFO_ST:
        value = rp2040_sio_fifo_status(s, core);
        break;
    case SIO_FIFO_RD:
        value = rp2040_sio_fifo_pop(s, core);
        break;
    case SIO_SPINLOCK_ST:
        value = s->spinlock_st;
        break;
    case SIO_DIV_UDIVIDEND:
    case SIO_DIV_SDIVIDEND:
        value = s->div_dividend[core];
        break;
    case SIO_DIV_UDIVISOR:
    case SIO_DIV_SDIVISOR:
        value = s->div_divisor[core];
        break;
    case SIO_DIV_QUOTIENT:
        value = s->div_quotient[core];
        s->div_dirty[core] = false;
        break;
    case SIO_DIV_REMAINDER:
        value = s->div_remainder[core];
        break;
    case SIO_DIV_CSR:
        value = rp2040_sio_div_csr(s, core);
        break;
    default:
        if (rp2040_sio_spinlock_offset(reg, &index)) {
            value = (s->spinlock_st & BIT(index)) ? 0 : BIT(index);
            s->spinlock_st |= BIT(index);
        } else {
            value = 0;
            rp2040_log_unimplemented_read("sio", size,
                                          RP2040_SIO_BASE + addr, addr,
                                          value);
        }
        break;
    }

