patchew-project/qemu/hw/misc/rp2040_sio.c
    return extract64(value, shift, size * 8);
}

static void rp2040_sio_write(void *opaque, hwaddr addr,
                             uint64_t value64, unsigned size)
{
    RP2040SioState *s = opaque;
    unsigned core = rp2040_sio_current_core();
    unsigned interp;
    unsigned index;
    unsigned shift = (addr & 3) * 8;
    hwaddr interp_reg;
    hwaddr reg = addr & ~3ULL;
    uint32_t value = (uint32_t)value64 << shift;

    if (rp2040_sio_interp_offset(reg, &interp, &interp_reg)) {
        rp2040_sio_interp_write(s, core, interp, interp_reg, value);
        return;
    }

    switch (reg) {
    case SIO_GPIO_OUT:
        s->gpio_out = value & SIO_GPIO_MASK;
        break;
    case SIO_GPIO_OUT_SET:
        s->gpio_out |= value & SIO_GPIO_MASK;
        break;
    case SIO_GPIO_OUT_CLR:
        s->gpio_out &= ~(value & SIO_GPIO_MASK);
        break;
    case SIO_GPIO_OUT_XOR:
        s->gpio_out ^= value & SIO_GPIO_MASK;
        break;
    case SIO_GPIO_OE:
        s->gpio_oe = value & SIO_GPIO_MASK;
        break;
    case SIO_GPIO_OE_SET:
        s->gpio_oe |= value & SIO_GPIO_MASK;
        break;
    case SIO_GPIO_OE_CLR:
        s->gpio_oe &= ~(value & SIO_GPIO_MASK);
        break;
    case SIO_GPIO_OE_XOR:
        s->gpio_oe ^= value & SIO_GPIO_MASK;
        break;
    case SIO_GPIO_HI_OUT:
        s->gpio_hi_out = value & SIO_GPIO_HI_MASK;
        break;
    case SIO_GPIO_HI_OUT_SET:
        s->gpio_hi_out |= value & SIO_GPIO_HI_MASK;
        break;
    case SIO_GPIO_HI_OUT_CLR:
        s->gpio_hi_out &= ~(value & SIO_GPIO_HI_MASK);
        break;
    case SIO_GPIO_HI_OUT_XOR:
        s->gpio_hi_out ^= value & SIO_GPIO_HI_MASK;
        break;
    case SIO_GPIO_HI_OE:
        s->gpio_hi_oe = value & SIO_GPIO_HI_MASK;
        break;
    case SIO_GPIO_HI_OE_SET:
        s->gpio_hi_oe |= value & SIO_GPIO_HI_MASK;
        break;
    case SIO_GPIO_HI_OE_CLR:
        s->gpio_hi_oe &= ~(value & SIO_GPIO_HI_MASK);
        break;
    case SIO_GPIO_HI_OE_XOR:
        s->gpio_hi_oe ^= value & SIO_GPIO_HI_MASK;
        break;
    case SIO_FIFO_ST:
        s->fifo_sticky[core] &= ~(value & SIO_FIFO_ST_WC_MASK);
        break;
    case SIO_FIFO_WR:
        rp2040_sio_fifo_push(s, core, value);
        break;
    case SIO_DIV_UDIVIDEND:
        s->div_dividend[core] = value;
        rp2040_sio_divide(s, core, false);
        break;
    case SIO_DIV_UDIVISOR:
        s->div_divisor[core] = value;
        rp2040_sio_divide(s, core, false);
        break;
    case SIO_DIV_SDIVIDEND:
        s->div_dividend[core] = value;
        rp2040_sio_divide(s, core, true);
        break;
    case SIO_DIV_SDIVISOR:
        s->div_divisor[core] = value;
        rp2040_sio_divide(s, core, true);
        break;
    case SIO_DIV_QUOTIENT:
        s->div_quotient[core] = value;
        s->div_dirty[core] = true;
        break;
    case SIO_DIV_REMAINDER:
        s->div_remainder[core] = value;
        s->div_dirty[core] = true;
        break;
    default:
        if (rp2040_sio_spinlock_offset(reg, &index)) {
            s->spinlock_st &= ~BIT(index);
        } else {
            rp2040_log_unimplemented_write("sio", size,
                                           RP2040_SIO_BASE + addr, addr,
                                           value64);
        }
        break;
    }
}

static const MemoryRegionOps rp2040_sio_ops = {
    .read = rp2040_sio_read,
    .write = rp2040_sio_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,
        .max_access_size = 4,
        .unaligned = false,
    },
};

static void rp2040_sio_reset(DeviceState *dev)
{
    RP2040SioState *s = RP2040_SIO(dev);

    s->gpio_in &= SIO_GPIO_MASK;
    s->gpio_hi_in &= SIO_GPIO_HI_MASK;
    s->gpio_out = 0;
    s->gpio_oe = 0;
    s->gpio_hi_out = 0;
    s->gpio_hi_oe = 0;
    memset(s->fifo, 0, sizeof(s->fifo));
    memset(s->fifo_rptr, 0, sizeof(s->fifo_rptr));
    memset(s->fifo_wptr, 0, sizeof(s->fifo_wptr));
    memset(s->fifo_level, 0, sizeof(s->fifo_level));
    memset(s->fifo_sticky, 0, sizeof(s->fifo_sticky));
    memset(s->div_dividend, 0, sizeof(s->div_dividend));
    memset(s->div_divisor, 0, sizeof(s->div_divisor));
    memset(s->div_quotient, 0, sizeof(s->div_quotient));
    memset(s->div_remainder, 0, sizeof(s->div_remainder));
    memset(s->div_dirty, 0, sizeof(s->div_dirty));
    memset(s->interp_accum, 0, sizeof(s->interp_accum));
    memset(s->interp_base, 0, sizeof(s->interp_base));
    memset(s->interp_ctrl, 0, sizeof(s->interp_ctrl));
    s->spinlock_st = 0;
    rp2040_sio_update_fifo_irq(s);
}

static void rp2040_sio_init(Object *obj)
{
    RP2040SioState *s = RP2040_SIO(obj);

    memory_region_init_io(&s->iomem, obj, &rp2040_sio_ops, s,
                          TYPE_RP2040_SIO, 0x1000);
    sysbus_init_mmio(SYS_BUS_DEVICE(obj), &s->iomem);
    sysbus_init_irq(SYS_BUS_DEVICE(obj), &s->fifo_irq[0]);
    sysbus_init_irq(SYS_BUS_DEVICE(obj), &s->fifo_irq[1]);
}

static const VMStateDescription vmstate_rp2040_sio = {
    .name = TYPE_RP2040_SIO,
    .version_id = 3,
    .minimum_version_id = 2,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32(gpio_out, RP2040SioState),
        VMSTATE_UINT32(gpio_in, RP2040SioState),
        VMSTATE_UINT32(gpio_hi_in, RP2040SioState),
        VMSTATE_UINT32(gpio_oe, RP2040SioState),
        VMSTATE_UINT32(gpio_hi_out, RP2040SioState),
        VMSTATE_UINT32(gpio_hi_oe, RP2040SioState),
        VMSTATE_UINT32_2DARRAY(fifo, RP2040SioState, RP2040_SIO_NUM_CORES,
                               RP2040_SIO_FIFO_DEPTH),
        VMSTATE_UINT8_ARRAY(fifo_rptr, RP2040SioState,
                            RP2040_SIO_NUM_CORES),
        VMSTATE_UINT8_ARRAY(fifo_wptr, RP2040SioState,
                            RP2040_SIO_NUM_CORES),
        VMSTATE_UINT8_ARRAY(fifo_level, RP2040SioState,
                            RP2040_SIO_NUM_CORES),
        VMSTATE_UINT32_ARRAY(fifo_sticky, RP2040SioState,
                             RP2040_SIO_NUM_CORES),
        VMSTATE_UINT32_ARRAY(div_dividend, RP2040SioState,
                             RP2040_SIO_NUM_CORES),
        VMSTATE_UINT32_ARRAY(div_divisor, RP2040SioState,
                             RP2040_SIO_NUM_CORES),
        VMSTATE_UINT32_ARRAY(div_quotient, RP2040SioState,
                             RP2040_SIO_NUM_CORES),
        VMSTATE_UINT32_ARRAY(div_remainder, RP2040SioState,
                             RP2040_SIO_NUM_CORES),
        VMSTATE_BOOL_ARRAY(div_dirty, RP2040SioState,
                           RP2040_SIO_NUM_CORES),
        VMSTATE_UINT32_2DARRAY_V(interp_accum, RP2040SioState,
                                 RP2040_SIO_NUM_CORES,
                                 RP2040_SIO_NUM_INTERPS *
                                 RP2040_SIO_INTERP_NUM_LANES, 3),
        VMSTATE_UINT32_2DARRAY_V(interp_base, RP2040SioState,
                                 RP2040_SIO_NUM_CORES,
                                 RP2040_SIO_NUM_INTERPS *
                                 RP2040_SIO_INTERP_NUM_BASES, 3),
        VMSTATE_UINT32_2DARRAY_V(interp_ctrl, RP2040SioState,
                                 RP2040_SIO_NUM_CORES,
                                 RP2040_SIO_NUM_INTERPS *
                                 RP2040_SIO_INTERP_NUM_LANES, 3),
        VMSTATE_UINT32(spinlock_st, RP2040SioState),
        VMSTATE_END_OF_LIST()
    }
};

static const Property rp2040_sio_properties[] = {
    DEFINE_PROP_UINT32("gpio-in", RP2040SioState, gpio_in, 0),
    DEFINE_PROP_UINT32("gpio-hi-in", RP2040SioState, gpio_hi_in, 0),
};

static void rp2040_sio_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    device_class_set_legacy_reset(dc, rp2040_sio_reset);
    device_class_set_props(dc, rp2040_sio_properties);
    dc->vmsd = &vmstate_rp2040_sio;
}

static const TypeInfo rp2040_sio_info = {
    .name = TYPE_RP2040_SIO,
    .parent = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(RP2040SioState),
    .instance_init = rp2040_sio_init,
    .class_init = rp2040_sio_class_init,
};

static void rp2040_sio_register_types(void)
{
    type_register_static(&rp2040_sio_info);
}
type_init(rp2040_sio_register_types)
